import Image from "next/image";
import React from "react";
import ImageSection from "../_components/imageSection";
import ListSection from "../_components/listSection";

const images = [
  "/images/Picture3.jpg",
  "/images/Picture4.jpg",
  "/images/Picture13.jpg",
  "/images/Picture14.jpg",
  "/images/Picture15.jpg",
  "/images/Picture16.jpg",
  "/images/Picture17.jpg",
  "/images/Picture18.jpg",
  "/images/Picture19.jpg",
  "/images/Picture20.jpg",
];

function Page() {
  return (
    <div className="my-30 mx-5 md:mx-20">
      <div className="flex flex-col w-full">
        <ImageSection
          src="/images/Picture1.jpg"
          alt="تصویر اصلی"
          className="w-full h-[500px] md:h-[1000px]"
        />
        <p className="py-10 text-justify">
          چایخانه حضرت رضا علیه السلام که برگرفته از صحن و سرای حرم مطهر امام
          رضا علیه السلام می باشد بدین صورت شکل گرفت که در ابتدای به امر بعد از
          ارتباط با آستان قدس رضوی و آشنایی با چگونگی و نحوه ساخت مجموعه ، تصمیم
          به ایجاد چایخانه حضرت رضا علیه السلام در غالب مجموعه فرهنگی مذهبی
          گرفته شد. از مورخ 6 مرداد 1400 مصادف با عید غدیر آغاز به کار گردید .
          که طی مشارکت شهرداری شاهرود ظرف مدت 10 روز کاری احداث گردید . سازه
          توسط شهرداری شاهرود آماده گردید و به کمک اعضا تجهیز و راه اندازی شد.
        </p>
        <ImageSection
          src="/images/Picture2.jpg"
          alt="تصویر دوم"
          className="w-full h-[500px] md:h-[800px] my-10"
        />
        <div className="grid grid-cols-1 md:grid-cols-2 justify-items-center-safe w-full gap-10">
          {["/images/Picture21.jpg", "/images/Picture6.jpg"].map((src, idx) => (
            <ImageSection
              key={idx}
              src={src}
              alt={`تصویر ${idx + 4}`}
              className="w-full md:w-[650px] h-[450px] md:h-[650px]"
            />
          ))}
        </div>
        <ListSection
          title="از تاریخ 6 مرداد 1400 تا پایان سال 1403  چایخانه بیش از 800  روز ارائه خدمت کرده است که شامل :"
          items={[
            "- جشن عید غدیر 1400-1401-1402-1403",
            "-	عزاداری دهه اول محرم – تاسوعا و عاشورا در دونوبت صبح و عصر 1400-1401-1402-1403",
            "-	عزاداری شهادت حضرت رقیه به همراه مراسم ویژه برای دختر بچه ها 1400-1401-1402-1403",
            "-	اربعین حسینی – موکب جاده بسطام و عزاداری در چایخانه شاهرود 1400-1401-1402-1403",
            "-	دهه آخر صفر  1400-1401-1402-1403",
            "-	رحلت پیامبر اکرم و شهادت امام حسن مجتبی 1400-1401-1402-1403",
            "-	شهادت امام رضا علیه السلام – شام غریبان امام رضا علیه السلام 1400-1401-1402-1403",
            "-	شهادت امام حسن عسگری علیه السلام 1400-1401-1402-1403",
            "-	جشن آغاز امامت امام زمان  1400-1401-1402-1403",
            "-	ولادت پیامبر اکرم و امام جعفر صادق علیه السلام 1400-1401-1402-1403",
            "-	ولادت امام حسن عسگری علیه السلام 1400-1401-1402-1403",
            "-	وفات حضرت معصومه(س) 1400-1401-1402-1403",
            "-	ولادت حضرت زینب(س) 1400-1401-1402-1403",
            "-	شهادت حضرت زهرا (س)   هر دو دهه فاطمیه 1400-1401-1402-1403",
            "-	ولادت حضرت سجاد علیه السلام 1400-1401-1402-1403",
            "-	شهادت حضرت ام البنین (س) 1400-1401-1402-",
            "-	ولادت حضرت زهرا سلام الله علیها 1400-1401-1402-1403",
            "-	ولادت حضرت امام محمد باقر علیه السلام 1400-1401-1402-1403",
            "-	شهادت حضرت امام هادی علیه السلام 1400-1401-1402-1403",
            "-	ولادت حضرت امام جواد علیه السلام 1400-1401-1402",
            "-	ولادت حضرت علی علیه السلام (روز پدر) 1400-1401-1402",
            "-	شهادت حضرت زینب سلام الله علیه 1400-1401-1402-1403",
            "-	سالگرد پیروزی انقلاب اسلامی 22 بهمن 1400-1401-1402-1403",
            "-	شهادت امام صادق (ع) 1401-1402-1403",
            "-	عید قربان 1401--1402-1403",
            "-	عید غدیر 1401-1402-1403",
            "-	دهه اول محرم 1401-1402-1403",
            "-	دهه آخر صفر 1401-1402-1403",
            "-	چهار شنبه های امام رضایی در طول سال هر هفته",
            "-	دعای ندبه  صبح جمعه همراه با پذیرایی تعداد محدود",
            "-	بزرگداشت شهید دفاع مقدس شهید مهدی ئی",
            "-	کارگاه کودک و نوجوان (نقاشی – سرود- اردو مذهبی(امامزاده بسطام)-خمیر بازی-جایزه-آموزش خادمیاری به کودکان-هدیه امام رضایی",
            "-	نگار گری و خطاطی و هدیه به مردم ",
            "-	پخش طنین صلوات خاصه امام رضا هر شب ساعت 8 ",
            "-	برگزاری نماز جماعت ",
            "-	تشکیل گروه جهادی سلامت و خدمت در بیمارستان جهت کمک در شرایط سخت کرونایی (آبمیوه طبیعی) ",
            "-	هدیه به دختر بچه ها به مناسبت شهادت حضرت رقیه",
            "-	هدیه اسباب بازی برای کودکان مرکز شیرخوارگان در روز شهادت حضرت علی اصغر",
            "-	توزیع پوستر و پرچم های محرمی به صورت رایگان بین مردم",
            "-	مراسم تعویض پرچم ",
            "-	توزیع کیک و شیرینی و شکلات و شربت",
            "-	ارائه میز خدمت رایگان با موضوع های : سلامت – حقوقی – روانشناسی-کتابخوانی- طب سنتی- مشاوره پوست و مو – مشاوره کودک و نوجوان-واکس رایگان",
          ]}
        />
        <div className="grid grid-cols-1 md:grid-cols-2 justify-items-center w-full gap-10">
          {["/images/Picture22.jpg", "/images/Picture23.jpg"].map(
            (src, idx) => (
              <ImageSection
                key={idx}
                src={src}
                alt={`تصویر ${idx + 7}`}
                className="w-[430px] h-[450px] md:w-[500px] md:h-[550px]"
              />
            )
          )}
        </div>
        <ListSection
          title={
            "همچنین چایخانه حضرت میزبان خادمین هیئات ، مساجد و کانونهای ذیل بوده است:"
          }
          items={[
            "1-	موکب الرضا (پذیرایی)",
            "2-	پادگان امام رضا (پذیرایی)",
            "3-	هیئت محبین الائمه (پذیرایی و مدیحه سرایی)",
            "4-	مسجد غربا- هیئت ریحانه الحسین(دمام زنی)",
            "5-	هیئت میاندار (عزاداری و پذیرایی)",
            "6-	هیئت محبان الحسین (پذیرایی)",
            "7-	هیئت عاشقان منتظر(پذیرایی)",
            "8-	هیئت عاشقان عباس(دسته عزاداری) ",
            "9-	کانون مسجد رسول اکرم- کانون خادمیاری قلعه نو خرقان",
            "10-	کانون خادمیاران دفتر مرکزی شاهرود",
            "11-	دسته عزاداری علامت کشان شاهرود",
            "12-	گروه موزیک سپه سالار کربلا",
            "13-	حاج شیخ محمود شاهرودی از بیت آیت ا... شاهرودی",
            "14-	گروه تعزیه دیزج",
            "15-	پایگاه بسیج طلاب",
            "16-	گردان عاشورا",
            "17-	هیات یا مهدی",
            "18-	سپاه ناحیه شاهرود",
          ]}
        />

        <div className="grid grid-cols-1 md:grid-cols-2 justify-items-center w-full gap-10">
          {["/images/Picture24.jpg", "/images/Picture25.jpg"].map(
            (src, idx) => (
              <ImageSection
                key={idx}
                src={src}
                alt={`تصویر ${idx + 18}`}
                className="w-full h-[450px] md:w-[500px] md:h-[550px]"
              />
            )
          )}
        </div>
        <ListSection
          title={"همچنین میزبان مسئولین محترم شاهرود از جمله :"}
          items={[
            "-	امام جمعه محترم شاهرود",
            "-	نماینده محترم شاهرود و میامی",
            "-	اعضای محترم شورای شهر ",
            "-	شهردار محترم قبلی و فعلی شاهرود  ",
            "-	دادستان محترم شاهرود",
            "-	مدیر کل محترم سازمان تبلیغات استان سمنان",
            "-	فرمانده پادگان امام رضا",
            "-	دادستان محترم دامغان",
            "-	فرمانده محترم سپاه شاهرود",
            "-	ریاست محترم دفتر آستان قدس رضوی شاهرود",
            "-	و دیگر عزیزان...",
          ]}
        />
        <div className="grid grid-cols-1 md:grid-cols-2 justify-items-center w-full gap-10">
          {["/images/Picture29.jpg", "/images/Picture30.jpg"].map(
            (src, idx) => (
              <ImageSection
                key={idx}
                src={src}
                alt={`تصویر ${idx + 10}`}
                className="w-full h-[350px] md:w-[550px] md:h-[350px]"
              />
            )
          )}
        </div>
        <ListSection
          title={"نکات مثبت و قابل تامل چایخانه حضرت رضا علیه السلام:"}
          items={[
            "-	امکان دسترسی آسان برای همشهریان و زائران عبوری",
            "-	رعایت پروتکل های بهداشتی طبق دستور العمل اعلامی وزارت بهداشت (فضای باز و فاصله گذاری اجتماعی)",
            "-	نبودن مکان مذهبی نزدیک این مکان",
            "-	منظر مذهبی زیبا یا همان المان شهری",
            "-	گذری که بدون استفاده بود و محل پارگینگ خودروها بود به عنوان مکان مقدس و مذهبی تبدیل شده است.",
            "-	میزبانی از قشر های مختلف مردمی در مراسمات مذهبی و ملی که در بیشتر این ایام در شهر خبری نیست.",
            "-	باز خورد معنوی و روحی بسیار خوب برای همشهریان و حتی کسبه ",
            "-	هدایت زائران علی بن موسی الرضا جهت اسکان رایگان",
            "-	تاثیر گذاری پخش صدای نقار خانه حرم مطهر طبق گفته عموم مردم",
            "-	همراه بودن کانالهای مجازی موافق و مخالف شهرستان بدون کوچکترین اعتراض یا مخالفت",
            "-	ترویج فرهنگ و آداب امام رضایی بین کودکان ، نوجوانان و جوانان",
            "-	ارائه میز خدمت رایگان با موضوع های: مشاوره حقوقی – مشاوره روانشانسی – مشاوره کتابخوانی و ",
            "-	...",
          ]}
        />
        <ListSection
          title={"برنامه های آینده چایخانه حضرت رضا علیه السلام:"}
          items={[
            "-	ایجاد چایخانه های کوچکتر به صورت منطقه ای در سطح شهر به صورت دائمی یا موقت (مناسبتی)",
            "مشاوره حقوقی – مشاوره تربیتی – مشاوره خانواده- مشاوره بیمه ای – مشاوره درمانی و طب اسلامی و سنتی و ....",
            "-	ترویج فرهنگ کتاب با گذاشتن نمایشگاه موقت",
            "-	برگزاری کلیه مناسبتهای ملی و مذهبی",
            "-	تهیه و طبخ و توزیع غذای گرم بین فقرا و نیازمندان (که قبلا توسط کانونهای خادمیاری شناسایی شده اند.)",
            "-	ترویج وقف و نذر و آسان کردن پخش نذورات اموات و ....   (شرایط کرونا در وادی السلام )",
            "-	ایجاد بستر مناسب برای فعالیت هیئات مذهبی شهرستان و حومه",
            "-	الگو سازی مناسب به جهت رعایت پروتکلهای بهداشتی برای موکب داران شهرستان ",
          ]}
        />
        <div className="grid grid-cols-1 md:grid-cols-2 gap-10 justify-items-center w-full">
          {images.map((src, idx) => (
            <ImageSection
              key={idx}
              src={src}
              alt={`تصویر گالری ${idx + 1}`}
              className="w-full h-[350px] md:w-[500px] md:h-[350px]"
            />
          ))}
        </div>
        <p className="py-10 text-justify">
          در پایان از دفتر مرکزی خادمیاری رضوی و شهرداری محترم و همکاری شورای
          شهر شاهرود و همچنین از کلیه اعضا چایخانه بویژه بانیان محترم ( شرکت طب
          پلاستیک- شرکت آلیاژین قطعه – شرکت سیم و کابل مغان- شرکت پخش میهن- شرکت
          خوراک دام مارال)و دیگر دوستانی که در هزینه های این چایخانه قبول زحمت
          کردند ، کمال تشکر را داریم. امید است با توکل به خدا و حضرت رضا علیه
          السلام بتوانیم در کنار هم اثر گذار و مفید در فرهنگ سازی فرهنگ امام
          رضایی در سطح شهرستان باشیم.
        </p>
      </div>
    </div>
  );
}

export default Page;
